In [6]:
import pandas as pd

In [9]:
data = {'apple':[1,2,0,5],'orange':[2,3,5,4],'banana':[0,4,7,12]}
data

{'apple': [1, 2, 0, 5], 'orange': [2, 3, 5, 4], 'banana': [0, 4, 7, 12]}

In [10]:
df = pd.DataFrame(data)
df

   apple  orange  banana
0      1       2       0
1      2       3       4
2      0       5       7
3      5       4      12

In [13]:
df.head(2)

   apple  orange  banana
0      1       2       0
1      2       3       4

In [14]:
df.tail(2)

   apple  orange  banana
2      0       5       7
3      5       4      12

In [15]:
df = pd.DataFrame(data, index = ['A','B','C','D'])
df

   apple  orange  banana
A      1       2       0
B      2       3       4
C      0       5       7
D      5       4      12

In [20]:
df1 = pd.read_csv(r"C:\Users\HP\Desktop\Data-LB\New folder\MER_T07_02A-2020-02-03.csv")
df1

,MSN,YYYYMM,Value,Column_Order,Description,Unit
0,CLETPUS,194913,135451.32,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
1,CLETPUS,195013,154519.994,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
2,CLETPUS,195113,185203.657,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
3,CLETPUS,195213,195436.666,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
4,CLETPUS,195313,218846.325,1,"Electricity Net Generation From Coal, All Sectors",Million Kilowatthours
...,...,...,...,...,...,...
8211,ELETPUS,201906,351342.905,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8212,ELETPUS,201907,411583.828,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8213,ELETPUS,201908,401363.186,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8214,ELETPUS,201909,359300.603,13,Electricity Net Generation Total (including fr...,Million Kilowatthours
8215,ELETPUS,201910,321921.812,13,Electricity Net Generation Total (including fr...,Million Kilowatthours

In [21]:
a = [12,45,25,36,45]
s = pd.Series(a)
s

0    12
1    45
2    25
3    36
4    45
dtype: int64

In [22]:
s = pd.Series(data)

In [23]:
s

apple      [1, 2, 0, 5]
orange     [2, 3, 5, 4]
banana    [0, 4, 7, 12]
dtype: object

In [24]:
type(s)

pandas.core.series.Series

In [25]:
type(df)

pandas.core.frame.DataFrame